<?php

namespace code\define\table\backend;

/*
use code\define\table\backend\Accounts as accounts

use code\define\table\backend\Accounts as tableAccounts

*/

/*
 ------------------------------------------------------ 
說明
 ------------------------------------------------------ 
*/

/*
 ------------------------------------------------------ 
說明
 ------------------------------------------------------ 
*/
class Accounts
{

	// ------------------------------------------------------------------------------ 
	// ------------------------------------------------------------------------------ 
	// 常數 
	// ------------------------------------------------------------------------------ 
	// ------------------------------------------------------------------------------ 


	// ------------------------------------------------------ 
	// 常數 
	// ------------------------------------------------------ 
	const P_ID = "id";
	const ACCOUNT = "account";
	const PASSWORD = "password";
	const EMAIL = "email";
	const GENDER = "gender";
	const STATUS = "status";
	const COMMENT = "comment";
	const CREATED_AT = "created_at";
	const UPDATED_AT = "updated_at";

} 
