<?php

namespace hahaha\define;

use hahahasublib\hahaha_instance_trait;

/*
use hahaha\define\hahaha_define_table_type as type;
*/

/*
table 定義

因為怕寫錯要查麻煩，因此弄成對應表
*/
class hahaha_define_table_type
{	
    use hahaha_instance_trait;

    /*
    注意 : 沒有要做完，有做到才補
    */

    // ------------------------------------------------------------------------------------------- 
    // 
    // ------------------------------------------------------------------------------------------- 

    // -------------------------------------- 
    // -------------------------------------- 
    // block - 區塊
    // -------------------------------------- 
    // -------------------------------------- 
    // 項目 :  
    // type::BUTTON_SEPERATOR
    // type::BUTTON_ADD
    // type::BUTTON_SELECT_DELETE
    // type::BUTTON_SAVE_ALL
    // type::BUTTON_REFRESH_ALL
    // -------------------------------------- 

    // -------------------------------------- 
    // b_block
    // -------------------------------------- 
    // -------------------------------------- 
    const B_BLOCK_NORMAL = "b_block_normal";

    const B_BLOCK_SHORT_WRAP = "b_block_short_wrap";
    const B_BLOCK_SEPERATOR = "b_block_seperator";

    // -------------------------------------- 
    // -------------------------------------- 
    // table - 表
    // -------------------------------------- 
    // -------------------------------------- 
    // 項目 :  
    //
    // -------------------------------------- 



    // ------------------------------------------------------------------------------------------- 
    // 
    // ------------------------------------------------------------------------------------------- 
    
    
    // -------------------------------------- 
    // -------------------------------------- 
    // item - 項目
    // -------------------------------------- 
    // -------------------------------------- 
    // 這裡只是枚舉項目，請參考上面註解使用
    // 有列在上面，請確保功能正確性
    // -------------------------------------- 

    // -------------------------------------- 
    // label
    // -------------------------------------- 
    const LABEL = "label";
    const LABEL_BY_OPTION_VALUE = "label_by_option_value";
    // -------------------------------------- 
    // text
    // --------------------------------------     
    const TEXT = "text";
    const TEXT_EXIST_CHECK = "text_exist_check";
    // -------------------------------------- 
    // password
    // -------------------------------------- 
    const PASSWORD = "password";
    // -------------------------------------- 
    // combobox
    // -------------------------------------- 
    const COMBOBOX = "combobox";
    // -------------------------------------- 
    // checkbox
    // -------------------------------------- 
    const CHECKBOX = "checkbox";
    const CHECKBOX_SELECTED = "checkbox_selected";
    // -------------------------------------- 
    // radiobox
    // -------------------------------------- 
    const RADIOBOX = "radiobox";
    // -------------------------------------- 
    // image
    // -------------------------------------- 
    const IMAGE = "image";
    // -------------------------------------- 
    // upload
    // -------------------------------------- 
    const UPLOAD = "upload";
    // -------------------------------------- 
    // time
    // -------------------------------------- 
    const TIME = "time";
    // -------------------------------------- 
    // textarea
    // -------------------------------------- 
    const TEXTAREA = "textarea";
    // -------------------------------------- 
    // editor
    // -------------------------------------- 
    const EDITOR = "editor";
    // -------------------------------------- 

    // -------------------------------------- 
    // panel
    // --------------------------------------
    // key::USE => use_::B_BLOCK,
    // key::CONTENT => [self::B_PANEL_ADD],
    // key::USE => use_::SETTING,
    // key::CONTENT => [\XXX\hahaha_table_setting_panel_detail::class, 'hahaha'],
    // mix 沒事不要用，會亂，請先說清楚要幹嘛
    // 確認製程上沒問題才放行
    // key::USE => use::MIX;
    // key::CONTENT => [
    // 	[
    // 		use::B_BLOCK => self::B_PANEL_ADD
    // 	],
    // 	[
    // 		use::SETTING => \XXX\hahaha_table_setting_panel_detail::class, 'hahaha'
    // 	],
    // ],
    //
    // -------------------------------------- 
    const PANEL = "panel";
    // -------------------------------------- 

    // -------------------------------------- 
    // seperator
    // -------------------------------------- 
    const SEPERATOR = "seperator";
    // -------------------------------------- 
    // button
    // -------------------------------------- 
    const BUTTON = "button";
    // addition key : 
    // key::ICON    
    const BUTTON_ICON = "button_icon";
    const BUTTON_ICON_LINK = "button_icon_link";
    const BUTTON_ICON_TEXT = "button_icon_text";
    const BUTTON_SEPERATOR = "button_seperator";
    // -------------------------------------- 

    // ------------------------------------------------------------------------------------------- 
    // 
    // ------------------------------------------------------------------------------------------- 

	function __construct()
	{
		// $this->Initial();
	}
	
	public function Initial()
	{
        
	}


}


