<?php

namespace hahaha\define;

use hahahasublib\hahaha_instance_trait;

/*

use hahaha\define\hahaha_define_sql_key as key_;

use hahaha\define\hahaha_define_sql_key as sql_key;
*/

/*
table 定義

因為怕寫錯要查麻煩，因此弄成對應表
*/
class hahaha_define_sql_key
{
    use hahaha_instance_trait;

    /*
    注意 : 沒有要做完，有做到才補
    */

    // 如要其他類型，則這樣寫TEXT_HA
    // 因為有類型衝突，有衝突的加_，ex. INT_
    // 這裡是標籤，不是實際設定，例如integer對應某項laravel的validate設定組


    // https://www.doctrine-project.org/projects/doctrine-orm/en/2.7/reference/query-builder.html
    // 有空再列
    // --------------------------------------
    // key
    // --------------------------------------

    // ---------------------------------------------------------------------------
    // base
    // ---------------------------------------------------------------------------
    const SELECT = "select";
    const CONDITION = "condition";
    const SETTING = "setting";
    const ORDER = "order";
    const GROUP = "group";
    const HAVING = "having";




    // ---------------------------------------------------------------------------
    // where
    // ---------------------------------------------------------------------------

    // --------------------------------------
    // none
    // --------------------------------------
    const NONE = "none";
    // --------------------------------------
    // and
    // --------------------------------------
    const AND = "and";
    // --------------------------------------
    // or
    // --------------------------------------
    const OR = "or";
    // --------------------------------------
    // add
    // --------------------------------------
    const ADD = "add";
    // --------------------------------------

    // ---------------------------------------------------------------------------
    // other
    // ---------------------------------------------------------------------------


    // --------------------------------------
    // offset
    // --------------------------------------
    const OFFSET = "ofset";
    // --------------------------------------
    // limit
    // --------------------------------------
    const LIMIT = "limit";
    // --------------------------------------

    // ---------------------------------------------------------------------------
    // orderby
    // ---------------------------------------------------------------------------



	function __construct()
	{
		// $this->Initial();
	}

	public function Initial()
	{

	}


}


