{{-- 原始 : hahaha --}}
{{-- 維護 :  --}}
{{-- 指揮 :  --}}
{{-- ---------------------------------------------------------------------------------------------- --}}
{{-- 決定 : name --}}
{{-- 
    ----------------------------------------------------------------------------
    說明 : 
    ----------------------------------------------------------------------------   
    
    ----------------------------------------------------------------------------
--}}
{{-- ---------------------------------------------------------------------------------------------- --}}


{{--  請手動整理至上方  --}}
<link rel="stylesheet" href="{{asset("assets/plugin/animation/animation.css")}}">
{{--  --}}
<script src="{{asset("assets/module/backend/common/nav/main_nav/main_nav.js")}}"></script>
<link rel="stylesheet" href="{{asset("assets/module/backend/common/nav/main_nav/main_nav.css")}}">

@include('module.backend.common.nav.main_nav.main_nav')