{{-- 原始 : hahaha --}}
{{-- 維護 :  --}}
{{-- 指揮 :  --}}
{{-- ---------------------------------------------------------------------------------------------- --}}
{{-- 決定 : name --}}
{{-- 
    ----------------------------------------------------------------------------
    說明 : 
    ----------------------------------------------------------------------------   
    
    ----------------------------------------------------------------------------
--}}
{{-- ---------------------------------------------------------------------------------------------- --}}


<script src="{{asset("assets/module/front/common/relation/main_relation/main_relation.js")}}"></script>
<link rel="stylesheet" href="{{asset("assets/module/front/common/relation/main_relation/main_relation.css")}}">

@include('module.front.common.relation.main_relation.main_relation')